Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This is a long line ~ short ~ Any other long line ~
es_es: Esto es una línea larga ~ corta ~ Cualquier es una línea larga ~

source: ^^^^ selected block
es_es: ^^^^^ bloque seleccionado

source: Now use the command "Ivery <Esc>". The result is:
es_es: Ahora usa la orden «Imuy <Esc>». El resultado es:

source: This is a very long line ~ short ~ Any other very long line ~
es_es: Esto es una línea muy larga ~ corta ~ Esto es una línea muy larga ~

source: The "A" command works the same way, except that it appends after the right side of the block. And it does insert text in a short line. Thus you can make a choice whether you do or don't want to append text to a short line. There is one special case for "A": Select a Visual block and then use "$" to make the block extend to the end of each line. Using "A" now will append the text to the end of each line. Using the same example from above, and then typing "$A XXX<Esc>, you get this result:
es_es: La orden «A» funciona de la misma manera, excepto que se añade a la derecha del bloque. En este caso sí se añade al final de la línea corta. De este modo puede elegir si quieres añadir o no un texto a la línea corta. Hay un caso especial para «Ax: seleccione un bloque Visual y pulsw «$» para hacer que el bloque se extienda al final de cada línea. Usar «A» añadirá el texto al final de cada línea. De usar el mismo ejemplo que arriba y teclear «$A XXX<Esc>» obtendría el siguiente resultado:

source: This is a long line XXX ~ short XXX ~ Any other long line XXX ~
es_es: Esto es una línea larga XXX~ corta XXX~ Esto es una línea larga XXX~

source: This really requires using the "$" command. Vim remembers that it was used. Making the same selection by moving the cursor to the end of the longest line with other movement commands will not have the same result.
es_es: Esto requiere el uso de la orden «$». Vim recordará que los ha usado. Hacer la misma selección con el cursor hasta el final de la línea más larga con otras órdenes no te dará el mismo resultado.

source: The Visual block "c" command deletes the block and then throws you into Insert mode to enable you to type in a string. The string will be inserted in each line in the block. Starting with the same selection of the "long" words as above, then typing "c_LONG_<Esc>", you get this:
es_es: La orden de bloque Visual «c» elimina el bloque y le devuelve al modo Insertar para que escriba en una cadena de caracteres. La cadena se insertará en cada línea del bloque. Comenzando con la misma selección que las palabras zlarga» de arriba, y teclear después «c_LARGA_<Esc>», le daría esto:

source: This is a _LONG_ line ~ short ~ Any other _LONG_ line ~
es_es: Esto es una línea _LARGA_ ~ corta ~ Esto es una línea _LARGA_ ~

source: Just like with "I" the short line is not changed. Also, you can't enter a newline in the new text.
es_es: Tal y como ocurre con «Ix, la línea corta no cambia. Del mismo modo, no podrá introducir una nueva línea en el texto.

source: This is a new text ~ short ~ Any other new text ~
es_es: Esto es un texto nuevo ~ corta ~ Esto es un texto nuevo ~

source: Notice that, even though only the "long" word was selected, the text after it is deleted as well. Thus only the location of the left edge of the visual block really matters. Again, short lines that do not reach into the block are excluded.
es_es: Observe que aunque sólo se seleccionó la palabra «larga», el texto tras ella fue eliminado igualmente. Por lo tanto sólo la posición del borde izquierdo del eje izquierdo importa realmente. Una vez más, las palabras que no forman parte del bloque se excluyen.

source: To fill the whole block with one character, use the "r" command. Again, starting with the same example text from above, and then typing "rx":
es_es: Para rellenar un bloque completo con un sólo carácter, usw la orden «r». Pruébelo de nuevo con el texto de antes, pulsando «rx»:

source: This is a xxxx line ~ short ~ Any other xxxx line ~
es_es: Esto es una línea larga ~ corta ~ Cualquier es una línea larga ~

source: Note: If you want to include characters beyond the end of the line in the block, check out the 'virtualedit' feature in chapter 25.
es_es: Nota: Si desea incluir los caracteres más allá del final de línea en el bloque, consulte la opción 'virtualedit' en el capítulo 25.

source: The command ">" shifts the selected text to the right one shift amount, inserting whitespace. The starting point for this shift is the left edge of the visual block. With the same example again, ">" gives this result:
es_es: La orden «>» empuja el texto hacia la derecha un espacio determinado, insertando espacios en blanco. El punto base empleado para esta operación es el borde izquierdo del bloque visual. Con el mismo ejemplo de nuevo, «>» le da el resultado:

source: The shift amount is specified with the 'shiftwidth' option. To change it to use 4 spaces: >
es_es: El espacio del desplazamiento se especifica con la opción 'shiftwidth". Para cambiarlo a cuatro espacios: >

source: The "<" command removes one shift amount of whitespace at the left edge of the block. This command is limited by the amount of text that is there; so if there is less than a shift amount of whitespace available, it removes what it can.
es_es: La orden «<» desplaza por cada empuje la misma cantidad de espacios en blanco hacia la izquierda. Esta orden se limita al texto que se encuentre, de manera que eliminará la cantidad de espacio en blanco disponible sin sobreescribir texto.

source: This is a long line short Any other long line ~
es_es: Esto es una línea larga corta Esto es una línea larga ~

source: The "J" command doesn't require a blockwise selection. It works with "v" and "V" selection in exactly the same way.
es_es: La orden «J» no requiere selección de bloques. Funciona de igual modo con la selección «v» y «V».

source: *10.6* Reading and writing part of a file
es_es: *10.6* Leer y escribir parte de un archivo

source: Hi John, ~ Here is the diff that fixes the bug: ~ Bye, Pierre. ~
es_es: Hola Juan, ~ Aquí tienes el parche que arregla el problema: ~ Un saludo, Pedro. ~

source: :read patch
es_es: :read parche

source: Hi John, ~ Here is the diff that fixes the bug: ~ 2c2 ~ < for (i = 0; i <= length; ++i) ~ --- ~ > for (i = 0; i < length; ++i) ~ Bye, Pierre. ~
es_es: Hola Juan, ~ Aquí tienes el parche que arregla el problema: ~ 2c2 ~ < for (i = 0; i <= length; ++i) ~ --- ~ > for (i = 0; i < length; ++i) ~ Un saludo, Pedro. ~

source: The ":read" command accepts a range. The file will be put below the last line number of this range. Thus ":$r patch" appends the file "patch" at the end of the file. What if you want to read the file above the first line? This can be done with the line number zero. This line doesn't really exist, you will get an error message when using it with most commands. But this command is allowed: > :0read patch
es_es: La orden «:read» acepta un rango. El archivo será colocado justo debajo de la última línea de este rango. Por lo tanto, «:$r parche» añadirá el archivo «parche» al final del actual. ¿Qué ocurre si quiere pegar el archivo encima de la primera línea? Esto se puede realizar con el número de línea cero. Este número de línea en realidad no existe, lo cuál hará que con muchas órdenes reciba un error. > > :0read parche

source: To write a range of lines to a file, the ":write" command can be used. Without a range it writes the whole file. With a range only the specified lines are written: >
es_es: Para guardar un rango de líneas en un archivo puede usar la orden «:write». Sin el rango esto guardará el archivo completo. Pero con un rango especificado únicamente las líneas que se especifiquen se escribirán: >

source: This writes the lines from the cursor until the end of the file into the file "tempo". If this file already exists you will get an error message. Vim protects you from accidentally overwriting an existing file. If you know what you are doing and want to overwrite the file, append !: >
es_es: Esto guardará las líneas desde el cursor hasta el final del texto en el archivo «tempo». Si este archivo existe actualmente obtendrá un mensaje de error. Vim le protege de que sobreescriba un archivo preexistente. Si sabe lo que hace y quiere sobreescribirlo, añada «!»: >

source: CAREFUL: The ! must follow the ":write" command immediately, without white space. Otherwise it becomes a filter command, which is explained later in this chapter.
es_es: CUIDADO: El «!» debe ponerse justo después de la orden «:write», sin el espacio en blanco. En caso contrario, se convierte en una orden de filtro, el cuál se explica en el capítulo siguiente.

source: In the first section of this chapter was explained how to collect a number of lines into a register. The same can be done to collect lines in a file. Write the first line with this command: >
es_es: En la primera sección de este capítulo se explicó cómo reunir una serie de líneas en un registro. Se puede hacer lo mismo para reunir líneas en un archivo. Escriba una primera línea con esta orden: >

source: :.write collection
es_es: :.write archivo

source: :.write >>collection
es_es: :.write >>archivo

source: The ">>" tells Vim the "collection" file is not to be written as a new file, but the line must be appended at the end. You can repeat this as many times as you like.
es_es: El «>>» le dice a Vim que «archivo» no se debe escribir como un nuevo archivo sino que la línea se deba añadir al final. Puede repetir esto tantas veces como desee.

source: *10.7* Formatting text
es_es: *10.7* Formatear texto

source: When you are typing plain text, it's nice if the length of each line is automatically trimmed to fit in the window. To make this happen while inserting text, set the 'textwidth' option: >
es_es: Cuando introducza texto, tal vez le resulta útil que, si la longitud de cada línea supera un número, sea automáticamente partida. Para hacer esto posible, active la opción 'textwidth': >

source: You might remember that in the example vimrc file this command was used for every text file. Thus if you are using that vimrc file, you were already using it. To check the current value of 'textwidth': >
es_es: Quizá se acuerde de que en el ejemplo de archivo «vimrc» esta orden era empleada para cualquier tipo de archivo. Por lo tanto, si está usando ese archivo «vimrc», ya lo tiene activado. Para comprobar el valor actual: >

source: Note: A blank line, which contains white space, does NOT separate paragraphs. This is hard to notice!
es_es: Nota: Una línea que contiene espacios en blanco NO separa párrafos. Esto suele ser difícil de notar.

source: Instead of "ap" you could use any motion or text object. If your paragraphs are properly separated, you can use this command to format the whole file: >
es_es: En lugar de «ap» puede usar cualquier movimiento u objeto de texto. Si sus párrafos están adecuadamente separados, puede usar esto para formatear todo: >

source: *10.8* Changing case
es_es: *10.8* Cambiar mayúsculas y minúsculas

source: You have text with section headers in lowercase. You want to make the word "section" all uppercase. Do this with the "gU" operator. Start with the cursor in the first column: >
es_es: Suponga que tiene texto con las cabeceras de sección en minúscula. Quiere que la palabra «sección» esté en mayúsculas. Puede hacerlo con el operador «gU». Comience con el cursor en la primera columna: >

source: gUw < section header ----> SECTION header
es_es: gUw < cabecera de sección ----> cabecera de SECCIÓN

source: guw < SECTION header ----> section header
es_es: guw cabecera de SECCIÓN ----> cabecera de sección

source: g~~ < Some GIRLS have Fun ----> sOME girls HAVE fUN ~
es_es: g~~ Algunas CHICAS se divierten ----> aLGUNAS chicas SE DIVIERTEN ~

source: *10.9* Using an external program
es_es: *10.9* Uso de un programa externo

source: Vim has a very powerful set of commands, it can do anything. But there may still be something that an external command can do better or faster. The command "!{motion}{program}" takes a block of text and filters it through an external program. In other words, it runs the system command represented by {program}, giving it the block of text represented by {motion} as input. The output of this command then replaces the selected block. Because this summarizes badly if you are unfamiliar with UNIX filters, take a look at an example. The sort command sorts a file. If you execute the following command, the unsorted file input.txt will be sorted and written to output.txt. (This works on both UNIX and Microsoft Windows.) >
es_es: Vim tiene un conjunto de órdenes muy potente para hacer cualquier cosa. Pero siempre hay un programa externo que es mejor para una tarea específica. La orden «!{movimiento}{programa}» recoge un bloque de un texto y lo filtra a través de un programa externo. En otras palabras, ejecuta la orden de sistema {programa}, dándole el bloque de texto representado por {movimiento} como entrada. La salida de la orden sustituirá la selección. Ya que esto requiere más explicación si no usa los filtros UNIX habitualmente, veamos un ejemplo. La orden «sort» ordena un archivo. Si ejecuta lo siguiente, el archivo desordenado entrada.txt será ordenado y guardado en output.txt. (Esto funciona en UNIX y en Windows.) >

source: Now do the same thing in Vim. You want to sort lines 1 through 5 of a file. You start by putting the cursor on line 1. Next you execute the following command: >
es_es: Ahora haga lo mismo en Vim. Desea ordenar las líneas de la 1 a la 5. Para comenzar, ponga el cursor en la línea 1. A continuación ejecute la siguiente orden: >

source: The "!" tells Vim that you are performing a filter operation. The Vim editor expects a motion command to follow, indicating which part of the file to filter. The "5G" command tells Vim to go to line 5, so it now knows that it is to filter lines 1 (the current line) through 5. In anticipation of the filtering, the cursor drops to the bottom of the screen and a ! prompt displays. You can now type in the name of the filter program, in this case "sort". Therefore, your full command is as follows: >
es_es: El «!» le dice a Vim que está realizando una operación filtro. El editor Vim espera que introduzca a continuación un orden de movimiento para saber qué filtrar. La orden «5G» le dice a Vim que vaya a la línea 5, de forma que sepa que tiene que filtrar desde la línea 1 (la actual) hasta la 5. Antes de filtrar nada, la línea de órdenes se activa y muestra un «!». Ahora es el momento de que escriba el filtro, en este caso «sort». Por lo tanto, la orden completo sería: >

source: !5Gsort<Enter>
es_es: !5Gsort<Entrar>

source: The result is that the sort program is run on the first 5 lines. The output of the program replaces these lines.
es_es: El resultado es que se ejecuta el programa «sort» sobre las 5 primeras líneas. La salida del programa reemplaza estas líneas.

source: line 55 line 11 line 33 line 22 line 11 --> line 33 line 22 line 44 line 44 line 55 last line last line
es_es: línea 55 línea 11 línea 33 línea 22 línea 11 --> línea 33 línea 22 línea 44 línea 44 línea 55 última línea última línea

source: The "!!" command filters the current line through a filter. In Unix the "date" command prints the current time and date. "!!date<Enter>" replaces the current line with the output of "date". This is useful to add a timestamp to a file.
es_es: La orden «!!» filtra la línea actual. En Unix, la orden »date» imprime la hora y fecha actuales. «!!date<Entrar>» reemplaza la línea actual con la salida de «date». Esto es útil para añadir una marca de tiempo al archivo.

source: Starting a shell, sending it text and capturing the output requires that Vim knows how the shell works exactly. When you have problems with filtering, check the values of these options:
es_es: Iniciar la consola, enviarle texto y capturar la salida requiere que Vim sepa exactamente cómo funciona la consola de forma precisa. Cuando tenga problemas con el filtrado, comprueba los valores de las siguientes opciones:

source: 'shell' specifies the program that Vim uses to execute external programs. 'shellcmdflag' argument to pass a command to the shell 'shellquote' quote to be used around the command 'shellxquote' quote to be used around the command and redirection 'shelltype' kind of shell (only for the Amiga) 'shellslash' use forward slashes in the command (only for MS-Windows and alikes) 'shellredir' string used to write the command output into a file
es_es: 'shell' especifica el programa que Vim empleará para ejecutar programas externos. 'shellcmdflag' argumento para pasar un orden a la consola 'shellquote' comillas a usar alrededor de la orden 'shellxquote' comillas a usar alrededor de la orden y redirección 'shelltype' tipo de consola (sólo para Amiga) 'shellslash' usar barras inclinadas en la orden (sólo para Windows y similares) 'shellredir' cadena para escribir la salida a un archivo

source: On Unix this is hardly ever a problem, because there are two kinds of shells: "sh" like and "csh" like. Vim checks the 'shell' option and sets related options automatically, depending on whether it sees "csh" somewhere in 'shell'. On MS-Windows, however, there are many different shells and you might have to tune the options to make filtering work. Check the help for the options for more information.
es_es: En Unix esto es raramente un problema, porque hay dos tipos de consola: «sh» y «csh». Vim comprueba la opción 'shell' y configura todo automáticamente, dependiendo de si ve «cshx en algún lugar de 'shell'. Sin embargo, en Windows, hay muchos tipos de consolas y quizá tenga que ajustar las opciones para hacer que el filtrado funcione correctamente. Busque en la ayuda más información sobre las opciones de configuración de la consola para poder solucionarlo.

source: on Unix: > :read !ls on MS-Windows: > :read !dir
es_es: en Unix: > :read !ls en MS-Windows: > :read !dir

source: The output of the "ls" or "dir" command is captured and inserted in the text, below the cursor. This is similar to reading a file, except that the "!" is used to tell Vim that a command follows. The command may have arguments. And a range can be used to tell where Vim should put the lines: >
es_es: La salida de las órdenes «ls» o «dir» se puede capturar e insertar en el texto, debajo del cursor. Esto es similar a leer un archivo, excepto que el «!» se emplea para decirle a Vim que hay una orden a continuación. Puede que la orden tenga argumentos. Puede emplear un rango para decirle a Vim dónde debería poner las líneas: >

source: This inserts the current time and date in UTC format at the top of the file. (Well, if you have a date command that accepts the "-u" argument.) Note the difference with using "!!date": that replaced a line, while ":read !date" will insert a line.
es_es: Esto inserta la hora y fecha actuales en formato UTC en la primera línea del archivo. (Bueno, si tienes una orden «date» que acepta el argumento «-u».) Tenga en cuenta la diferencia de usar «!!date»; esto reemplazó una línea, mientras que «:read !date» insertó una línea.

source: The Unix command "wc" counts words. To count the words in the current file: >
es_es: La orden Unix «wc» cuenta palabras. Para contar las del archivo actual: >

source: This is the same write command as before, but instead of a file name the "!" character is used and the name of an external command. The written text will be passed to the specified command as its standard input. The output could look like this:
es_es: Esta es la misma orden «write» vista que anteriormente, pero en lugar de un nombre de archivo, se emplean el carácter «!» y una orden externa. El texto guardado será pasado al orden especificado como entrada estándar. La salida será algo así:

source: The "wc" command isn't verbose. This means you have 4 lines, 47 words and 249 characters.
es_es: La orden «wc» no es muy informativa. Esto significa que tiene 4 líneas, 47 palabras y 249 caracteres.

source: This will write the file "wc" in the current directory, with force. White space is important here!
es_es: Esto guardará el archivo «wc» en el directorio actual con la opción «force» (forzar). ¡El espacio en blanco es muy importante en este caso!

source: If the external command produced an error message, the display may have been messed up. Vim is very efficient and only redraws those parts of the screen that it knows need redrawing. But it can't know about what another program has written. To tell Vim to redraw the screen: >
es_es: Si la orden externa produjo un mensaje de error, la pantalla de Vim tal vez esté sobreescrita con información confusa. Vim es muy eficiente y sólo reescribe aquellas partes de la pantalla que lo necesiten. Pero no puede saber sobre lo que otro programa ha tocado. Para decirle a Vim que redibuje la pantalla: >

source: *usr_20.txt* For Vim version 7.3. Last change: 2006 Apr 24
es_es: *usr_20.esx* Para Vim versión 7.3. Último cambio: 24/5/2006

source: Typing command-line commands quickly
es_es: Ser eficaz con la línea de órdenes

source: Vim has a few generic features that makes it easier to enter commands. Colon commands can be abbreviated, edited and repeated. Completion is available for nearly everything.
es_es: Vim posee algunas características genéricas que le facilitan introducir órdenes. Las órdenes de colon («:») se pueden abreviar, editar y repetir. Dispone de auto compleción para prácticamente todo.

source: |20.1| Command line editing |20.2| Command line abbreviations |20.3| Command line completion |20.4| Command line history |20.5| Command line window
es_es: |20.1| Edición en línea de órdenes |20.2| Abreviaturas en línea de órdenes |20.3| Autocompletado en la línea de órdenes |20.4| Histórico de la línea de órdenes |20.5| Ventana de la línea de órdenes

source: Next chapter: |usr_21.txt| Go away and come back Previous chapter: |usr_12.txt| Clever tricks Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_21.esx| Abandonar el editor y volver Capítulo anterior: |usr_12.esx| Trucos ingeniosos Tabla de contenidos: |usr_toc.esx|

source: *20.1* Command line editing
es_es: *20.1* Edición en línea de órdenes

source: When you use a colon (:) command or search for a string with / or ?, Vim puts the cursor on the bottom of the screen. There you type the command or search pattern. This is called the Command line. Also when it's used for entering a search command.
es_es: Cuando usa una orden de colon («:») o busca una cadena con «/» o «?», Vim sitúa el cursor en la parte inferior de la pantalla. Ahí es donde introduce la orden o el patrón de búsqueda. A esto se le llama la línea de órdenes. También cuando se usa para introducir una orden de búsqueda.

source: The most obvious way to edit the command you type is by pressing the <BS> key. This erases the character before the cursor. To erase another character, typed earlier, first move the cursor with the cursor keys. For example, you have typed this: >
es_es: La manera más obvia de editar la orden introducida es pulsando la tecla <BS>. Esto elimina el carácter anterior al cursor. Para eliminar otro carácter introducido previamente, desplace antes el cursor con las teclas del cursos. Por ejemplo, suponga que ha tecleado esto: >

source: :s/col/pig/
es_es: :s/vaba/cerdo/

source: Before you hit <Enter>, you notice that "col" should be "cow". To correct this, you type <Left> five times. The cursor is now just after "col". Type <BS> and "w" to correct: >
es_es: Antes de pulsar <Intro>, notará que «vaba» debería ser «vaca». Para corregir esto, pulse <Izquierda> seis veces. El cursor está ahora sobre «vaba». Teclee <BS> y «w» para corregirlo: >

source: :s/cow/pig/
es_es: :s/vaca/cerdo/
